## 집계구별 인구 전처리

In [1]:
import pandas as pd 
import numpy as np

In [4]:
path = r'C:\Users\709-000\Desktop\_census_reqdoc_1570978802549'

In [5]:
df = pd.read_csv(path+'/2018년기준_2017년_성연령별인구.txt', encoding='euc-kr', sep='^')

In [6]:
df.head()

   base_year      tot_oa_cd        item  value
0       2017  1101053010001  in_age_001   15.0
1       2017  1101053010001  in_age_002    7.0
2       2017  1101053010001  in_age_003    NaN
3       2017  1101053010001  in_age_004   10.0
4       2017  1101053010001  in_age_005   23.0

In [7]:
df.fillna(0, inplace=True)

In [8]:
df.head()

   base_year      tot_oa_cd        item  value
0       2017  1101053010001  in_age_001   15.0
1       2017  1101053010001  in_age_002    7.0
2       2017  1101053010001  in_age_003    0.0
3       2017  1101053010001  in_age_004   10.0
4       2017  1101053010001  in_age_005   23.0

In [9]:
df['code'] = df['item'].str[-3:].astype('int')

In [10]:
df.head(10)

   base_year      tot_oa_cd        item  value  code
0       2017  1101053010001  in_age_001   15.0     1
1       2017  1101053010001  in_age_002    7.0     2
2       2017  1101053010001  in_age_003    0.0     3
3       2017  1101053010001  in_age_004   10.0     4
4       2017  1101053010001  in_age_005   23.0     5
5       2017  1101053010001  in_age_006   50.0     6
6       2017  1101053010001  in_age_007   49.0     7
7       2017  1101053010001  in_age_008   29.0     8
8       2017  1101053010001  in_age_009   30.0     9
9       2017  1101053010001  in_age_010   29.0    10

In [11]:
df2 = df[(df['code'] >= 14) & (df['code'] <= 21)]

In [13]:
df3 = df2.groupby(['base_year','tot_oa_cd']).sum().reset_index().drop('code', axis=1)

In [20]:
df3["base_year"] = df3["base_year"].astype('str')
df3["tot_oa_cd"] = df3["tot_oa_cd"].astype('str')

In [21]:
df3.to_csv(path+'/집계구별 65세이상 총인구.csv', encoding='euc-kr', index=False)